app/views/users/_user.html.erb

SELECT "users"."id" FROM "users" INNER JOIN "enrollments" ON "users"."id" = "enrollments"."teacher_id" WHERE "enrollments"."user_id" = ?  [["user_id", 1]]
---
    <strong>Favorite Teachers:</strong>
    <%= user.teachers.ids.map {|user_id| User.find(user_id).name }.join(', ') %>

SELECT "users".* FROM "users" WHERE (kind == 0 && id != 1)
---
    <strong>Class Mates:</strong>
    <%= User.classmates(user).map(&:name).join(', ') %>