app/controllers/users_controller.rb

SELECT "users"."id" FROM "users" WHERE "users"."user_id" = ?  [["user_id", 1]]
---
  def index
    @users = User.all

INSERT INTO "users" ("name", "age", "kind", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "testing1"], ["age", 22], ["kind", 0], ["created_at", "2023-08-23 10:01:03.193305"], ["updated_at", "2023-08-23 10:01:03.193305"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "kind" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["kind", 1], ["updated_at", "2023-08-24 09:22:43.710096"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)